src/src/Catalogs/Campaigns.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Campaigns</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>StartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Activities</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Activity</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CampaignActivities</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>HighlightColor</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/src/Catalogs/Campaigns/Forms/ItemForm/Ext/Form/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If ValueIsFilled(Object.Ref) Then
		
		SetObjectColors(Object.Ref);
		
	ElsIf Parameters.Property("CopyingValue") AND ValueIsFilled(Parameters.CopyingValue) Then
		
		SetObjectColors(Parameters.CopyingValue);
		
	EndIf;
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	For Each Activity In Object.Activities Do
			
		CurrentObject.Activities[Activity.LineNumber-1].HighlightColor = New ValueStorage(Activity.Color);
			
	EndDo;
	
EndProcedure

&AtClient
Procedure AfterWrite(WriteParameters)
	
	Notify("Write_Campaigns");
	SetObjectColors(Object.Ref);
	
EndProcedure

#EndRegion

#Region FormItemsEventHadlers

&AtClient
Procedure ActivitiesOnChange(Item)
	
	SetConditionalAppearance();
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure SetConditionalAppearance()
	
	ConditionalAppearance.Items.Clear();
	
	For Each Activity In Object.Activities Do
		
		SetLineConditionalAppearance(Activity.LineNumber, Activity.Color);
		
	EndDo;
	
EndProcedure

&AtServer
Procedure SetLineConditionalAppearance(LineNumber, Color)
	
	Item = ConditionalAppearance.Items.Add();

	ItemField = Item.Fields.Items.Add();
	ItemField.Field = New DataCompositionField("ActivitiesColor");

	FilterItem = Item.Filter.Items.Add(Type("DataCompositionFilterItem"));
	FilterItem.LeftValue		= New DataCompositionField("Object.Activities.LineNumber");
	FilterItem.ComparisonType	= DataCompositionComparisonType.Equal;
	FilterItem.RightValue		= LineNumber;

	Item.Appearance.SetParameterValue("BackColor", Color);
	
	Item.Use = True;
	
EndProcedure

&AtServer
Procedure SetObjectColors(CampaignRef)
	
	For Each Activity In CampaignRef.Activities Do
		
		Object.Activities[Activity.LineNumber-1].Color = Activity.HighlightColor.Get();
		
	EndDo;
	
	SetConditionalAppearance();
	
EndProcedure


#EndRegion
